БПКР/src/InformationRegisters/СведенияОбЭСФ/СведенияОбЭСФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбЭСФ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЭСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерКорректируемогоЭСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКорректируемогоЭСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСпособаОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияКорректируемогоСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КорректировкаСтоимостиДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаСтоимостиПоступления</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаСтоимостиРеализации</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/CommonModules/ЭСФСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает сведения ЭСФ для документа
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации - ссылка на организацию	  
//  ДокументОснование	 - ДокументСсылка.РеализацияТоваровУслуг - ссылка на документ, для котрого нужно получить представление
// 
// Возвращаемое значение:
//  СведенияОбЭСФ - Структура
//
Функция СведенияОбЭСФПоДокументуОснованию(Организация, ДокументОснование, ПредставлениеЭСФ = "") Экспорт
	
	СведенияОбЭСФ = Новый Структура;
	СведенияОбЭСФ.Вставить("ПредставлениеЭСФ", ПредставлениеЭСФ);
	СведенияОбЭСФ.Вставить("Ссылка", Неопределено);
	СведенияОбЭСФ.Вставить("Дата", Дата(1, 1, 1));
	СведенияОбЭСФ.Вставить("ДатаПоставки", Дата(1, 1, 1));
	СведенияОбЭСФ.Вставить("НомерЭСФ", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СведенияОбЭСФ.Регистратор КАК Ссылка,
		|	СведенияОбЭСФ.Дата КАК Дата,
		|	СведенияОбЭСФ.ДатаПоставки КАК ДатаПоставки,
		|	СведенияОбЭСФ.НомерЭСФ КАК НомерЭСФ
		|ИЗ
		|	РегистрСведений.СведенияОбЭСФ КАК СведенияОбЭСФ
		|ГДЕ
		|	СведенияОбЭСФ.Организация = &Организация
		|	И СведенияОбЭСФ.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СведенияОбЭСФ.ПредставлениеЭСФ = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаполнитьЗначенияСвойств(СведенияОбЭСФ, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат СведенияОбЭСФ;	
	
КонецФункции

Функция СведенияОбЭСФНоНомеруЭСФ(Организация, НомерЭСФ) Экспорт 

	Результат = Новый Структура;
	Результат.Вставить("ДокументОснование", Неопределено);
	Результат.Вставить("ДокументСсылка", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбЭСФ.ДокументОснование КАК ДокументОснование,
		|	СведенияОбЭСФ.Регистратор КАК ДокументСсылка
		|ИЗ
		|	РегистрСведений.СведенияОбЭСФ КАК СведенияОбЭСФ
		|ГДЕ
		|	СведенияОбЭСФ.Организация = &Организация
		|	И СведенияОбЭСФ.НомерЭСФ = &НомерЭСФ";
	Запрос.УстановитьПараметр("НомерЭСФ", НомерЭСФ);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // СведенияОбЭСФНоНомеруЭСФ()


#КонецОбласти
